Oliverjun6/STM32_KEY_LED_Run_without_blocking/0-12upgrate_stm_key/HARDWARE/KEY/key.c
#include "stm32f10x.h"
#include "key.h"
#include "sys.h" 
#include "delay.h"
		
uint8_t Key_Num;		
//按键初始化函数
void KEY_Init(void) //IO初始化
{ 
 	GPIO_InitTypeDef GPIO_InitStructure;
 
 	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA|RCC_APB2Periph_GPIOE,ENABLE);//使能PORTA,PORTE时钟

	GPIO_InitStructure.GPIO_Pin  = GPIO_Pin_4|GPIO_Pin_3;//KEY0-KEY1
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPU; //设置成上拉输入
 	GPIO_Init(GPIOE, &GPIO_InitStructure);//初始化GPIOE4,3

	//初始化 WK_UP-->GPIOA.0	  下拉输入
	GPIO_InitStructure.GPIO_Pin  = GPIO_Pin_0;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPD; //PA0设置成输入，默认下拉	  
	GPIO_Init(GPIOA, &GPIO_InitStructure);//初始化GPIOA.0

}
//按键处理函数
//返回按键值
//mode:0,不支持连续按;1,支持连续按;
//0，没有任何按键按下
//1，KEY0按下
//2，KEY1按下
//3，KEY3按下 WK_UP
//注意此函数有响应优先级,KEY0>KEY1>KEY_UP!!
u8 KEY_Scan(u8 mode)
{	 
	static u8 key_up=1;//按键按松开标志
	if(mode)key_up=1;  //支持连按		  
	if(key_up&&(KEY0==0||KEY1==0||WK_UP==1))
	{
		delay_ms(10);//去抖动 
		key_up=0;
		if(KEY0==0)return KEY0_PRES;
		else if(KEY1==0)return KEY1_PRES;
		else if(WK_UP==1)return WKUP_PRES;
	}else if(KEY0==1&&KEY1==1&&WK_UP==0)key_up=1; 	    
 	return 0;// 无按键按下
}

uint8_t Get_Keynum(void)
{
	uint8_t temp;
	if(Key_Num !=0 )
	{
		temp = Key_Num;
		Key_Num = 0;
		return temp;
	}
	return 0;
}

uint8_t Get_Keystate(void)
{
	if(GPIO_ReadInputDataBit(GPIOE , GPIO_Pin_3) == 0)//KEY1
	{
		return 1;
	}
	if(GPIO_ReadInputDataBit(GPIOE , GPIO_Pin_4) == 0)
	{
		return 2;
	}
	
	return 0;
}

void Key_tick(void)
{
	static uint8_t count;
	static uint8_t Current_sta;
	static uint8_t Pre_sta;
	count++;
	if(count == 20)
	{
		count = 0;
		Pre_sta = Current_sta;
		Current_sta = Get_Keystate();
		if(Current_sta == 0 && Pre_sta != 0)//按键按下松开后的情况
		{
			Key_Num = Pre_sta;
		}
	}
}

